app/src/main/assets/soap/request_bipro503-getdata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.bipro.net/namespace/prozesse/schaden" xmlns:bas="http://www.bipro.net/namespace/basis" xmlns:nac="http://www.bipro.net/namespace/nachrichten" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:all="http://www.bipro.net/namespace/allgemein" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:prod="http://www.bipro.net/namespace/produktmodell" xmlns:sch1="http://www.bipro.net/namespace/schaden">
    ${soapHeader}
    <soapenv:Body>
        <sch:getData>
            <sch:Request>
                <nac:BiPROVersion>${version}</nac:BiPROVersion>
                <nac:ConsumerID>BiPRO Client</nac:ConsumerID>
                <sch:Schadenauskunft>
                    <sch:Schadennummer>
                        <all:Nummer>${schadennr}</all:Nummer>
                    </sch:Schadennummer>
                    <!--#IFDEF ${vunr}--><sch:Unternehmen><all:Nummer>${vunr}</all:Nummer><all:Nummernart>BaFin</all:Nummernart></sch:Unternehmen><!--/#IFDEF-->
                </sch:Schadenauskunft>
            </sch:Request>
        </sch:getData>
    </soapenv:Body>
</soapenv:Envelope>